PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif_memslot.c
                        uint32_t sfdpRet = (uint32_t)CY_SMIF_SUCCESS;
                        if (0U != (memCfg->flags & CY_SMIF_FLAG_DETECT_SFDP))
                        {
                            sfdpRet = (uint32_t)Cy_SMIF_MemSfdpDetect(base,
                                      memCfg->deviceCfg,
                                      memCfg->slaveSelect,
                                      memCfg->dataSelect,
                                      context);
                            if ((uint32_t)CY_SMIF_SUCCESS != sfdpRet)
                            {
                                sfdpRes |= ((uint32_t)CY_SMIF_SFDP_FAIL << idx);
                            }
                        }
                        /* Check the size of the smif memory slot address */
                        CY_ASSERT_L2(MEM_ADDR_SIZE_VALID(memCfg->deviceCfg->numOfAddrBytes));

                        /* Check if SMIF XIP is already enabled, then do not overwrite XIP registers */
                        if (((uint32_t)CY_SMIF_SUCCESS == sfdpRet) &&
                                (0U != (memCfg->flags & CY_SMIF_FLAG_MEMORY_MAPPED)) &&
                                (_FLD2VAL(SMIF_CTL_XIP_MODE, SMIF_CTL(base)) != 1U))
                        {
                            /* Check valid parameters for XIP */
                            CY_ASSERT_L3(MEM_ADDR_VALID(memCfg->baseAddress, memCfg->memMappedSize));
                            CY_ASSERT_L3(MEM_MAPPED_SIZE_VALID(memCfg->memMappedSize));

                            XipRegInit(device, memCfg);

#if(CY_IP_MXSMIF_VERSION>=2)
                            context->preXIPDataRate = memCfg->deviceCfg->readCmd->dataRate;
#endif /* CY_IP_MXSMIF_VERSION */
#if (CY_IP_MXSMIF_VERSION >= 4)
                            if (context->preXIPDataRate == CY_SMIF_DDR)
                            {
                                SMIF_DEVICE_RX_CAPTURE_CONFIG(device) |= _VAL2FLD(SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_DDR_PIPELINE_POS_DAT, 1U) |
                                    _VAL2FLD(SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_DDR_SWAP_BYTES, 1U);
                            }
                            /* DDR_PIPELINE_POS_DAT should be SET for RX Capture mode xSPI */
                            if (_FLD2VAL(SMIF_CORE_CTL2_RX_CAPTURE_MODE, (SMIF_CTL2(base))) == (uint32_t)CY_SMIF_SEL_XSPI_HYPERBUS_WITH_DQS)
                            {
                                SMIF_DEVICE_RX_CAPTURE_CONFIG(device) |= _VAL2FLD(SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_DDR_PIPELINE_POS_DAT, 1U);
                            }
#endif

                            /* The device control register initialization */
                            SMIF_DEVICE_CTL(device) = _VAL2FLD(SMIF_DEVICE_CTL_WR_EN, ((bool)(memCfg->flags & CY_SMIF_FLAG_WRITE_ENABLE)) ? 1U : 0U) |
                                                      _VAL2FLD(SMIF_DEVICE_CTL_CRYPTO_EN, ((bool)(memCfg->flags & CY_SMIF_FLAG_CRYPTO_ENABLE)) ? 1U : 0U) |
                                                      _VAL2FLD(SMIF_DEVICE_CTL_DATA_SEL, (uint32_t)memCfg->dataSelect) |
#if(CY_IP_MXSMIF_VERSION>=2)
                                                      _VAL2FLD(SMIF_DEVICE_CTL_MERGE_EN, ((bool)(memCfg->flags & CY_SMIF_FLAG_MERGE_ENABLE)) ? 1U : 0U)  |
                                                      _VAL2FLD(SMIF_DEVICE_CTL_MERGE_TIMEOUT, (uint32_t)memCfg->mergeTimeout) |
#endif /* CY_IP_MXSMIF_VERSION */
                                                      SMIF_DEVICE_CTL_ENABLED_Msk;
                        }
                    }
                    else
                    {
                        result = (uint32_t)CY_SMIF_BAD_PARAM;
                        break;
                    }
                }
#if (CY_IP_MXSMIF_VERSION>=2) && defined (SMIF_HYPERBUS_DEVICE_SUPPORT)
                else if (memCfg->hbdeviceCfg != NULL)
                {
                    result = (uint32_t)Cy_SMIF_HyperBus_InitDevice(base, memCfg, context);
                }
#endif /* (CY_IP_MXSMIF_VERSION>=2) && defined (SMIF_HYPERBUS_DEVICE_SUPPORT) */
                else
                {
                    result = (uint32_t)CY_SMIF_BAD_PARAM;
                    break;
                }
            }
        }
    }
    if ((uint32_t)CY_SMIF_SUCCESS != sfdpRes)
    {
        result = (((uint32_t)CY_SMIF_ID) | ((uint32_t)CY_PDL_STATUS_ERROR) | sfdpRes);
    }
    return (cy_en_smif_status_t) result;
}

/*******************************************************************************
* Function Name: Cy_SMIF_MemDeInit
****************************************************************************//**
*
* This function de-initializes all slave slots of the memory device to their default
* values.
*
* \param base
* Holds the base address of the SMIF block registers.
*
*******************************************************************************/
void Cy_SMIF_MemDeInit(SMIF_Type *base)
{
    /* Configure the SMIF device slots to the default values. The default value is 0 */
    uint32_t deviceIndex;

#if (CY_IP_MXSMIF_VERSION >= 5)
    SMIF_CLK_HSIOM(base) = (uint32_t)HSIOM_SEL_GPIO;
    SMIF_RWDS_HSIOM(base) = (uint32_t)HSIOM_SEL_GPIO;
    SMIF_CLK_DRIVEMODE(base) = CY_GPIO_DM_ANALOG | (CY_GPIO_DM_ANALOG << 8U);
    SMIF_RWDS_DRIVEMODE(base) = CY_GPIO_DM_ANALOG;
#endif

    for (deviceIndex = 0UL; deviceIndex < (uint32_t)SMIF_DEVICE_NR; deviceIndex++)
    {
        SMIF_DEVICE_IDX_CTL(base, deviceIndex)           = 0U;
        SMIF_DEVICE_IDX_ADDR(base, deviceIndex)          = 0U;
        SMIF_DEVICE_IDX_MASK(base, deviceIndex)          = 0U;
        SMIF_DEVICE_IDX_ADDR_CTL(base, deviceIndex)      = 0U;
        SMIF_DEVICE_IDX_RD_CMD_CTL(base, deviceIndex)    = 0U;
        SMIF_DEVICE_IDX_RD_ADDR_CTL(base, deviceIndex)   = 0U;
        SMIF_DEVICE_IDX_RD_MODE_CTL(base, deviceIndex)   = 0U;
        SMIF_DEVICE_IDX_RD_DUMMY_CTL(base, deviceIndex)  = 0U;
        SMIF_DEVICE_IDX_RD_DATA_CTL(base, deviceIndex)   = 0U;
        SMIF_DEVICE_IDX_WR_CMD_CTL(base, deviceIndex)    = 0U;
        SMIF_DEVICE_IDX_WR_ADDR_CTL(base, deviceIndex)   = 0U;
        SMIF_DEVICE_IDX_WR_MODE_CTL(base, deviceIndex)   = 0U;
        SMIF_DEVICE_IDX_WR_DUMMY_CTL(base, deviceIndex)  = 0U;
        SMIF_DEVICE_IDX_WR_DATA_CTL(base, deviceIndex)   = 0U;
    }
}


