PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif_memslot.c
/*******************************************************************************
* Function Name: Cy_SMIF_MemCmdWriteEnable
****************************************************************************//**
*
* This function sends the Write Enable command to the memory device.
*
* \note This function uses the low-level Cy_SMIF_TransmitCommand() API.
* The Cy_SMIF_TransmitCommand() API works in a blocking mode. In the dual quad mode,
* this API is called for each memory.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memDevice
* The device to which the command is sent.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of the command transmission.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*       - \ref CY_SMIF_CMD_NOT_FOUND
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemCmdWriteEnable(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        cy_stc_smif_context_t const *context)
{
    /* The memory Write Enable */
    cy_stc_smif_mem_cmd_t *writeEn = memDevice->deviceCfg->writeEnCmd;

    cy_en_smif_status_t result = CY_SMIF_CMD_NOT_FOUND;

    if (NULL != writeEn)
    {
#if (CY_IP_MXSMIF_VERSION>=2)
        result = Cy_SMIF_TransmitCommand_Ext(base,
                                             (uint16_t)(writeEn->command | writeEn->commandH << 8),
                                             (writeEn->cmdWidth == CY_SMIF_WIDTH_OCTAL) ? true : false,
                                             writeEn->cmdWidth,
                                             writeEn->cmdRate,
                                             NULL,
                                             0,
                                             CY_SMIF_WIDTH_NA,
                                             writeEn->addrRate,
                                             memDevice->slaveSelect,
                                             CY_SMIF_TX_LAST_BYTE,
                                             context);
#else
        result = Cy_SMIF_TransmitCommand(base, (uint8_t) writeEn->command,
                                         writeEn->cmdWidth,
                                         NULL,
                                         CY_SMIF_CMD_WITHOUT_PARAM,
                                         CY_SMIF_WIDTH_NA,
                                         memDevice->slaveSelect,
                                         CY_SMIF_TX_LAST_BYTE,
                                         context);
#endif
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_SMIF_MemCmdWriteDisable
****************************************************************************//**
*
* This function sends a Write Disable command to the memory device.
*
* \note This function uses the low-level Cy_SMIF_TransmitCommand() API.
* Cy_SMIF_TransmitCommand() API works in a blocking mode. In the dual quad mode
* this API should be called for each memory.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memDevice
* The device to which the command is sent.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of the command transmission.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*       - \ref CY_SMIF_CMD_NOT_FOUND
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemCmdWriteDisable(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        cy_stc_smif_context_t const *context)
{
    cy_stc_smif_mem_cmd_t *writeDis = memDevice->deviceCfg->writeDisCmd;

    cy_en_smif_status_t result = CY_SMIF_CMD_NOT_FOUND;

    if (NULL != writeDis)
    {
#if (CY_IP_MXSMIF_VERSION>=2)
        result = Cy_SMIF_TransmitCommand_Ext(base,
                                             (uint16_t)(writeDis->command | writeDis->commandH << 8),
                                             (writeDis->cmdWidth == CY_SMIF_WIDTH_OCTAL) ? true : false,
                                             writeDis->cmdWidth,
                                             writeDis->cmdRate,
                                             NULL,
                                             0,
                                             CY_SMIF_WIDTH_NA,
                                             writeDis->addrRate,
                                             memDevice->slaveSelect,
                                             CY_SMIF_TX_LAST_BYTE,
                                             context);
#else
        /* The memory write disable */
        result = Cy_SMIF_TransmitCommand(base, (uint8_t)writeDis->command,
                                         writeDis->cmdWidth,
                                         NULL,
                                         CY_SMIF_CMD_WITHOUT_PARAM,
                                         CY_SMIF_WIDTH_NA,
                                         memDevice->slaveSelect,
                                         CY_SMIF_TX_LAST_BYTE,
                                         context);
#endif
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_SMIF_MemIsBusy
****************************************************************************//**
*
* This function checks if the status of the memory device is busy.
* This is done by reading the status register and the corresponding bit
* (stsRegBusyMask). This function is a blocking function until the status
* register from the memory is read.
*
* \note In the dual quad mode, this API is called for each memory.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memDevice
*  The device to which the command is sent.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of the memory device.
*       - True - The device is busy or a timeout occurs.
*       - False - The device is not busy.
*
* \note Check \ref group_smif_usage_rules for any usage restriction
*
*******************************************************************************/
bool Cy_SMIF_MemIsBusy(SMIF_Type *base, cy_stc_smif_mem_config_t const *memDevice,
                       cy_stc_smif_context_t const *context)
{
    uint16_t  status = 1U;
    cy_en_smif_status_t readStsResult = CY_SMIF_CMD_NOT_FOUND;
    cy_stc_smif_mem_device_cfg_t *device =  memDevice->deviceCfg;

