PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif_memslot.c
    if (NULL != device->readStsRegWipCmd)
    {
#if (CY_IP_MXSMIF_VERSION>=2)
        if (device->readStsRegWipCmd->cmdWidth == CY_SMIF_WIDTH_OCTAL)
        {
            uint8_t addr_param[4] = {0};
            /* Read the memory status register */
            readStsResult = Cy_SMIF_TransmitCommand_Ext(base,
                            (uint16_t)(device->readStsRegWipCmd->command | (device->readStsRegWipCmd->commandH << 8)),
                            true,
                            device->readStsRegWipCmd->cmdWidth,
                            device->readStsRegWipCmd->cmdRate,
                            addr_param, sizeof(addr_param),
                            device->readStsRegWipCmd->addrWidth,
                            device->readStsRegWipCmd->addrRate,
                            memDevice->slaveSelect,
                            CY_SMIF_TX_NOT_LAST_BYTE,
                            context);

            if ((CY_SMIF_SUCCESS == readStsResult) && (device->readStsRegWipCmd->dummyCycles > 0U))
            {
                readStsResult = Cy_SMIF_SendDummyCycles_Ext(base,
                                device->readStsRegWipCmd->addrWidth,
                                device->readStsRegWipCmd->addrRate,
                                device->readStsRegWipCmd->dummyCycles);
            }
            if (CY_SMIF_SUCCESS == readStsResult)
            {
                readStsResult = Cy_SMIF_ReceiveDataBlocking_Ext(base, (uint8_t *)&status,
                                (device->readStsRegWipCmd->cmdRate == CY_SMIF_DDR) ? 2U : 1U,
                                device->readStsRegWipCmd->cmdWidth,
                                device->readStsRegWipCmd->cmdRate,
                                context);
            }

        }
        else
        {
#endif
            readStsResult = Cy_SMIF_MemCmdReadStatus(base, memDevice, (uint8_t *)&status,
                            (uint8_t)device->readStsRegWipCmd->command,
                            context);
#if (CY_IP_MXSMIF_VERSION>=2)
        }
#endif
    }

    if (CY_SMIF_SUCCESS == readStsResult)
    {
        /* Masked not busy bits in returned status */
        status &= (uint8_t)device->stsRegBusyMask;
    }

    return (0U != status);
}


/*******************************************************************************
* Function Name: Cy_SMIF_MemQuadEnable
****************************************************************************//**
*
* This function enables the memory device for the quad mode of operation.
* This command must be executed before sending quad SPI commands to the
* memory device.
*
* \note In the dual quad mode, this API is called for each memory.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memDevice
* The device to which the command is sent.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of the command.
*   - \ref CY_SMIF_SUCCESS
*   - \ref CY_SMIF_NO_QE_BIT
*   - \ref CY_SMIF_CMD_FIFO_FULL
*   - \ref CY_SMIF_BAD_PARAM
*   - \ref CY_SMIF_CMD_NOT_FOUND
*
* \note Check \ref group_smif_usage_rules for any usage restriction
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemQuadEnable(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        cy_stc_smif_context_t const *context)
{
    cy_en_smif_status_t result = CY_SMIF_CMD_NOT_FOUND;
    uint8_t statusReg[CY_SMIF_QE_BIT_STATUS_REG2_T1] = {0U};
    cy_stc_smif_mem_device_cfg_t *device =  memDevice->deviceCfg;

    /* Check that command exists */
    if ((NULL != device->readStsRegQeCmd)  &&
            (NULL != device->writeStsRegQeCmd) &&
            (NULL != device->readStsRegWipCmd))
    {
        uint8_t readQeCmd  = (uint8_t)device->readStsRegQeCmd->command;
        uint8_t writeQeCmd = (uint8_t)device->writeStsRegQeCmd->command;
        uint8_t readWipCmd = (uint8_t)device->readStsRegWipCmd->command;

        result = Cy_SMIF_MemCmdReadStatus(base, memDevice, &statusReg[0U],
                                          readQeCmd, context);
        if (CY_SMIF_SUCCESS == result)
        {
            uint32_t qeMask = device->stsRegQuadEnableMask;

            switch (qeMask)
            {
            case CY_SMIF_SFDP_QE_BIT_6_OF_SR_1:
                statusReg[0U] |= (uint8_t)qeMask;
                result = Cy_SMIF_MemCmdWriteStatus(base, memDevice,
                                                   &statusReg[0U], writeQeCmd, context);
                break;
            case CY_SMIF_SFDP_QE_BIT_1_OF_SR_2:
                /* Read status register 1 with the assumption that WIP is always in
                * status register 1 */
                result = Cy_SMIF_MemCmdReadStatus(base, memDevice,
                                                  &statusReg[0U], readWipCmd, context);
                if (CY_SMIF_SUCCESS == result)
                {
                    result = Cy_SMIF_MemCmdReadStatus(base, memDevice,
                                                      &statusReg[1U], readQeCmd, context);
                    if (CY_SMIF_SUCCESS == result)
                    {
                        statusReg[1U] |= (uint8_t)qeMask;

                        if (writeQeCmd == CY_SMIF_WRITE_STATUS_REG2_T2_CMD)
                        {
                            result = Cy_SMIF_MemCmdWriteStatus(base, memDevice,
                                                               &statusReg[1U], writeQeCmd, context);
                        }
                        else
                        {
                            result = Cy_SMIF_MemCmdWriteStatus(base, memDevice,
                                                               statusReg, writeQeCmd, context);
                        }
                    }
                }
                break;
            case CY_SMIF_SFDP_QE_BIT_7_OF_SR_2:
                result = Cy_SMIF_MemCmdReadStatus(base, memDevice,
                                                  &statusReg[1U], readQeCmd, context);
                if (CY_SMIF_SUCCESS == result)
                {
                    statusReg[1U] |= (uint8_t)qeMask;
                    result = Cy_SMIF_MemCmdWriteStatus(base, memDevice,
                                                       &statusReg[1U], writeQeCmd, context);
                }
                break;
            default:
                result = CY_SMIF_NO_QE_BIT;
                break;
            }
        }
    }
    return (result);
}
#if (CY_IP_MXSMIF_VERSION>=2) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SMIF_MemOctalEnable
****************************************************************************//**
*
* This function enables the memory device for the octal mode of operation.
* This command must be executed before sending octal SPI commands to the
* memory device.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memDevice
* The device to which the command is sent.
*
* \param dataRate
* Specifies the data rate to enable (SDR/DDR).
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of the command.
*   - \ref CY_SMIF_SUCCESS
*   - \ref CY_SMIF_NO_OE_BIT
*   - \ref CY_SMIF_CMD_FIFO_FULL
*   - \ref CY_SMIF_BAD_PARAM
*   - \ref CY_SMIF_CMD_NOT_FOUND
*
* \note Check \ref group_smif_usage_rules for any usage restriction
*
* \snippet smif/snippet/main.c snippet_Cy_SMIF_MemOctalEnable
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemOctalEnable(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        cy_en_smif_data_rate_t dataRate,
        cy_stc_smif_context_t const *context)
{
    cy_en_smif_status_t result = CY_SMIF_CMD_NOT_FOUND;
    cy_stc_smif_mem_device_cfg_t *device =  memDevice->deviceCfg;

    if (dataRate == CY_SMIF_DDR)
    {
        cy_stc_smif_octal_ddr_en_seq_t *oDDREnSeq = device->octalDDREnableSeq;

        /* Send Command Sequence 1 */
        if ((oDDREnSeq != NULL) && (oDDREnSeq->cmdSeq1Len > 0U))
        {
            result = Cy_SMIF_TransmitCommand(base, oDDREnSeq->cmdSeq1[0], CY_SMIF_WIDTH_SINGLE,
                                             (uint8_t const *)&oDDREnSeq->cmdSeq1[1U],
                                             ((uint32_t)oDDREnSeq->cmdSeq1Len - 1U), CY_SMIF_WIDTH_SINGLE,
                                             memDevice->slaveSelect, CY_SMIF_TX_LAST_BYTE, context);
        }
        /* Send Command Sequence 2 */
        if ((oDDREnSeq != NULL) && (oDDREnSeq->cmdSeq2Len > 0U))
        {
            result = Cy_SMIF_TransmitCommand(base, oDDREnSeq->cmdSeq2[0], CY_SMIF_WIDTH_SINGLE,
                                             (uint8_t const *)&oDDREnSeq->cmdSeq2[1U],
                                             ((uint32_t)oDDREnSeq->cmdSeq2Len - 1U), CY_SMIF_WIDTH_SINGLE,
                                             memDevice->slaveSelect, CY_SMIF_TX_LAST_BYTE, context);
        }
    }
    else
    {
        /* Check that command exists */
        if ((NULL != device->readStsRegOeCmd)  &&
                (NULL != device->writeStsRegOeCmd))
        {
            uint8_t readOeCmd  = (uint8_t)device->readStsRegOeCmd->command;
            uint8_t writeOeCmd = (uint8_t)device->writeStsRegOeCmd->command;
            uint8_t writeEnCmd = (uint8_t)device->writeEnCmd->command;
            uint8_t octalEnableAddr[CY_SMIF_SFDP_ADDRESS_LENGTH + 1u] = {0U};

