PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif_memslot.c
            if ((CY_SMIF_SUCCESS == result) && (cmdProg->dummyCycles > 0U))
            {
                result = Cy_SMIF_SendDummyCycles_Ext(base, CY_SMIF_WIDTH_OCTAL, cmdProg->addrRate, cmdProg->dummyCycles);
            }

            if (CY_SMIF_SUCCESS == result)
            {
                result = Cy_SMIF_TransmitData_Ext(base, writeBuff, size,
                                                  cmdProg->dataWidth, cmdProg->dataRate, cmdCompleteCb, context);
            }

        }
        else
        {
#endif
            /* The page program command */
            result = Cy_SMIF_TransmitCommand(base, (uint8_t)cmdProg->command,
                                             cmdProg->cmdWidth, addr, device->numOfAddrBytes,
                                             cmdProg->addrWidth, slaveSelected, CY_SMIF_TX_NOT_LAST_BYTE,
                                             context);

            if ((CY_SMIF_SUCCESS == result) && (CY_SMIF_NO_COMMAND_OR_MODE != cmdProg->mode))
            {
                result = Cy_SMIF_TransmitCommand(base, (uint8_t)cmdProg->mode,
                                                 cmdProg->modeWidth, NULL,
                                                 CY_SMIF_CMD_WITHOUT_PARAM, CY_SMIF_WIDTH_NA,
                                                 (cy_en_smif_slave_select_t)slaveSelected,
                                                 CY_SMIF_TX_NOT_LAST_BYTE, context);
            }

            if ((CY_SMIF_SUCCESS == result) && (cmdProg->dummyCycles > 0U))
            {
                result = Cy_SMIF_SendDummyCycles(base, cmdProg->dummyCycles);
            }

            if (CY_SMIF_SUCCESS == result)
            {
                result = Cy_SMIF_TransmitData(base, writeBuff, size,
                                              cmdProg->dataWidth, cmdCompleteCb, context);
            }
#if (CY_IP_MXSMIF_VERSION>=2)
        }
#endif
    }

    return (result);
}


/*******************************************************************************
* Function Name: Cy_SMIF_MemCmdRead
****************************************************************************//**
*
* This function performs the Read operation.
*
* \note This function uses the Cy_SMIF_TransmitCommand() API.
* The Cy_SMIF_TransmitCommand() API works in the blocking mode. In the dual quad mode,
* this API works with both types of memory simultaneously.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memDevice
* The device to which the command is sent.
*
* \param addr
* The address to read.
*
* \param readBuff
* The pointer to the variable where the read data is stored. If this pointer is
* a NULL, then the function does not enable the interrupt. This use case is
* typically used when the FIFO is handled outside the interrupt and is managed
* in either a  polling-based code or a DMA. The user would handle the FIFO
* management in a DMA or a polling-based code.
* If the user provides a NULL pointer in this function and does not handle
* the FIFO transaction, this could either stall or timeout the operation
* \ref Cy_SMIF_TransmitData().
*
* \param size
* The size of data to read.
*
* \param cmdCompleteCb
* The callback function to call after the transfer completion. NULL interpreted
* as no callback.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of the transmission.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_CMD_FIFO_FULL
*       - \ref CY_SMIF_BAD_PARAM
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*       - \ref CY_SMIF_CMD_NOT_FOUND
*
* \note Check \ref group_smif_usage_rules for any usage restriction
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemCmdRead(SMIF_Type *base,
                                       cy_stc_smif_mem_config_t const *memDevice,
                                       uint8_t const *addr,
                                       uint8_t *readBuff,
                                       uint32_t size,
                                       cy_smif_event_cb_t cmdCompleteCb,
                                       cy_stc_smif_context_t *context)
{
    cy_en_smif_status_t result = CY_SMIF_BAD_PARAM;
    cy_en_smif_slave_select_t slaveSelected;
    cy_stc_smif_mem_device_cfg_t *device = memDevice->deviceCfg;
    cy_stc_smif_mem_cmd_t *cmdRead = device->readCmd;

    if (NULL == cmdRead)
    {
        result = CY_SMIF_CMD_NOT_FOUND;
    }
    else if (NULL == addr)
    {
        result = CY_SMIF_BAD_PARAM;
    }
    else
    {
        slaveSelected = (0U == memDevice->dualQuadSlots) ?  memDevice->slaveSelect :
                        (cy_en_smif_slave_select_t)memDevice->dualQuadSlots;

        result = Cy_SMIF_TransmitCommand(base, (uint8_t)cmdRead->command,
                                         cmdRead->cmdWidth, addr, device->numOfAddrBytes,
                                         cmdRead->addrWidth, slaveSelected, CY_SMIF_TX_NOT_LAST_BYTE,
                                         context);

        if ((CY_SMIF_SUCCESS == result) && (CY_SMIF_NO_COMMAND_OR_MODE != cmdRead->mode))
        {
            result = Cy_SMIF_TransmitCommand(base, (uint8_t)cmdRead->mode,
                                             cmdRead->modeWidth, NULL,
                                             CY_SMIF_CMD_WITHOUT_PARAM, CY_SMIF_WIDTH_NA,
                                             (cy_en_smif_slave_select_t)slaveSelected,
                                             CY_SMIF_TX_NOT_LAST_BYTE, context);
        }

        if ((CY_SMIF_SUCCESS == result) && (0U < cmdRead->dummyCycles))
        {
            result = Cy_SMIF_SendDummyCycles(base, cmdRead->dummyCycles);
        }

        if (CY_SMIF_SUCCESS == result)
        {
            result = Cy_SMIF_ReceiveData(base, readBuff, size,
                                         cmdRead->dataWidth, cmdCompleteCb, context);
        }
    }

    return (result);
}


