PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif_memslot.c
/*******************************************************************************
* Function Name: Cy_SMIF_MemLocateHybridRegion
****************************************************************************//**
*
* This function locates the region structure by the address which belongs to it.
*
* \note This function is valid for the memories with hybrid sectors.
*
* \param memDevice
* The memory device configuration.
*
* \param regionInfo
* Places a hybrid region configuration structure that contains the region
* specific parameters. See \ref cy_stc_smif_hybrid_region_info_t for
* reference.
*
* \param address
* The address for which a region is searched.
*
* \return A status of the region location.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_NOT_HYBRID_MEM
*       - \ref CY_SMIF_BAD_PARAM
*
* \funcusage
* \snippet smif/snippet/main.c snippet_Cy_SMIF_MemLocateHybridRegion
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemLocateHybridRegion(cy_stc_smif_mem_config_t const *memDevice,
        cy_stc_smif_hybrid_region_info_t **regionInfo,
        uint32_t address)
{
    cy_en_smif_status_t result = CY_SMIF_BAD_PARAM;
    cy_stc_smif_hybrid_region_info_t *currInfo = NULL;
    CY_ASSERT_L1(NULL != memDevice);
    cy_stc_smif_mem_device_cfg_t *device = memDevice->deviceCfg;

    /* Check if the address exceeds the memory size */
    if (address < device->memSize)
    {
        result = CY_SMIF_NOT_HYBRID_MEM;
        /* Check if the memory is hybrid */
        if (NULL != device->hybridRegionInfo)
        {
            uint32_t idx;
            uint32_t regionStartAddr;
            uint32_t regionEndAddr;
            for (idx = 0UL; idx < device->hybridRegionCount; idx++)
            {
                currInfo = device->hybridRegionInfo[idx];
                regionStartAddr = currInfo->regionAddress;
                regionEndAddr = regionStartAddr + (currInfo->sectorsCount * currInfo->eraseSize);
                if ((address >= regionStartAddr) && (address < regionEndAddr))
                {
                    *regionInfo = currInfo;
                    result = CY_SMIF_SUCCESS;
                    break;
                }
            }
        }
    }

    return result;
}

/*******************************************************************************
* Function Name: Cy_SMIF_SetReadyPollingDelay
****************************************************************************//**
*
* This function sets the polling delay in micro seconds to check memory device availability.
* By default polling delay is set to 0.
*
* \param pollTimeoutUs
* Specifies the polling timeout value in micro seconds.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
*
*******************************************************************************/
void Cy_SMIF_SetReadyPollingDelay(uint16_t pollTimeoutUs,
                                  cy_stc_smif_context_t *context)
{
    CY_ASSERT_L1(NULL != context);

    context->memReadyPollDelay = pollTimeoutUs;
}

/*******************************************************************************
* Function Name: Cy_SMIF_MemIsReady
****************************************************************************//**
*
* Polls the memory device to check whether it is ready to accept new commands or
* not until either it is ready or the retries have exceeded the limit.
* This is a blocking function, it will block the execution flow until
* the command transmission is completed.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* The memory device configuration.
*
* \param timeoutUs
*  The timeout value in microseconds to apply while polling the memory.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return The status of the operation.
* \ref CY_SMIF_SUCCESS        - Memory is ready to accept new commands.
* \ref CY_SMIF_EXCEED_TIMEOUT - Memory is busy.
*
* \funcusage
* \snippet smif/snippet/main.c snippet_Cy_SMIF_MemIsReady
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemIsReady(SMIF_Type *base, cy_stc_smif_mem_config_t const *memConfig,
                                       uint32_t timeoutUs, cy_stc_smif_context_t const *context)
{
    bool isBusy = Cy_SMIF_Memslot_IsBusy(base, (cy_stc_smif_mem_config_t*)memConfig, context);

    CY_ASSERT_L1(NULL != context);

    if (context->memReadyPollDelay > 0U)
    {
        if (isBusy)
        {
            uint16_t pollingDelay = (timeoutUs > context->memReadyPollDelay) ? context->memReadyPollDelay : (uint16_t)timeoutUs;
            do
            {
                /* Avoid using weak function if XIP is enabled */
                if (_FLD2VAL(SMIF_CTL_XIP_MODE, SMIF_CTL(base)) != 0U)
                {
                    Cy_SysLib_DelayUs(pollingDelay);
                }
                else
                {
                    Cy_SysLib_Rtos_DelayUs(pollingDelay);
                }
                isBusy = Cy_SMIF_Memslot_IsBusy(base, (cy_stc_smif_mem_config_t*)memConfig, context);
                timeoutUs = (timeoutUs > pollingDelay) ? (timeoutUs - pollingDelay) : 0UL;
            }
            while (isBusy && (timeoutUs > 0UL));
        }
    }
    else
    {
        if (isBusy)
        {
            uint32_t delayMs = 0UL;
            uint32_t timeoutSlice = 0UL;
            uint16_t delayUs = 0U;

            /* Calculate the slice of time to split the timeoutUs delay into TIMEOUT_SLICE_DIV times */
            timeoutSlice = timeoutUs / TIMEOUT_SLICE_DIV;

            /* Reduce the slice if needed to avoid too big idle period between checking the busy state */
            if (timeoutSlice > TIMEOUT_SLICE_MAX)
            {
                timeoutSlice = TIMEOUT_SLICE_MAX;
            }
            if (timeoutSlice == 0UL)
            {
                timeoutSlice = 1UL;
            }

            do
            {
                delayMs = timeoutSlice / 1000UL;
                delayUs = (uint16_t)(timeoutSlice % 1000UL);

                /* Avoid using weak function if XIP is enabled */
                if (_FLD2VAL(SMIF_CTL_XIP_MODE, SMIF_CTL(base)) != 0U)
                {
                    Cy_SysLib_Delay(delayMs);
                    Cy_SysLib_DelayUs(delayUs);
                }
                else
                {
                    Cy_SysLib_Rtos_Delay(delayMs);
                    Cy_SysLib_Rtos_DelayUs(delayUs);
                }

                isBusy = Cy_SMIF_Memslot_IsBusy(base, (cy_stc_smif_mem_config_t*)memConfig, context);

                timeoutUs = (timeoutUs > timeoutSlice) ? (timeoutUs - timeoutSlice) : 0UL;

