PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif_memslot.c
        /* SMIF can read only up to 65536 bytes in one go. Split the larger read into multiple chunks */
        while (length > 0UL)
        {
            /* Get the number of bytes which can be read during one operation */
            chunk = (length > SMIF_MAX_RX_COUNT) ? (SMIF_MAX_RX_COUNT) : length;
            ValueToByteArray(address, &addrArray[0], 0UL,
                             memConfig->deviceCfg->numOfAddrBytes);

#if (CY_IP_MXSMIF_VERSION>=2)
            status = Cy_SMIF_TransmitCommand_Ext(base,
                                                 (uint16_t)(cmdRead->command | cmdRead->commandH << 8),
                                                 ((bool)cmdRead->commandH),
                                                 cmdRead->cmdWidth,
                                                 cmdRead->cmdRate,
                                                 (const uint8_t *)addrArray,
                                                 memConfig->deviceCfg->numOfAddrBytes,
                                                 cmdRead->addrWidth,
                                                 cmdRead->addrRate,
                                                 memConfig->slaveSelect,
                                                 CY_SMIF_TX_NOT_LAST_BYTE,
                                                 context);

            if ((CY_SMIF_SUCCESS == status) && (CY_SMIF_NO_COMMAND_OR_MODE != cmdRead->mode))
            {
                status = Cy_SMIF_TransmitCommand_Ext(base,
                                                     (uint16_t)cmdRead->mode,
                                                     false,
                                                     cmdRead->modeWidth,
                                                     cmdRead->modeRate,
                                                     NULL,
                                                     CY_SMIF_CMD_WITHOUT_PARAM,
                                                     CY_SMIF_WIDTH_NA,
                                                     cmdRead->modeRate,
                                                     memConfig->slaveSelect,
                                                     CY_SMIF_TX_NOT_LAST_BYTE,
                                                     context);
            }

            if ((CY_SMIF_SUCCESS == status) && (0U < cmdRead->dummyCycles))
            {
#if ((CY_IP_MXSMIF_VERSION==2) || (CY_IP_MXSMIF_VERSION==3))
                uint32_t ifRxSel = _FLD2VAL(SMIF_CTL_CLOCK_IF_RX_SEL, SMIF_CTL(base));

                if (ifRxSel == (uint32_t)CY_SMIF_SEL_SPHB_RWDS_CLK || ifRxSel == (uint32_t)CY_SMIF_SEL_INVERTED_SPHB_RWDS_CLK)
                {
                    status = Cy_SMIF_SendDummyCycles_With_RWDS(base, true, (cmdRead->dummyCyclesPresence == CY_SMIF_PRESENT_2BYTE), cmdRead->dummyCycles);
                }
                else
#endif
#if (CY_IP_MXSMIF_VERSION >= 4)
                    if (_FLD2VAL(SMIF_CORE_CTL2_RX_CAPTURE_MODE, (SMIF_CTL2(base))) == (uint32_t)CY_SMIF_SEL_XSPI_HYPERBUS_WITH_DQS)
                    {
                        status = Cy_SMIF_SendDummyCycles_With_RWDS(base, true, (cmdRead->dummyCyclesPresence == CY_SMIF_PRESENT_2BYTE), cmdRead->dummyCycles);
                    }
                    else
#endif
                    {
                        status = Cy_SMIF_SendDummyCycles_Ext(base, cmdRead->dataWidth, cmdRead->dataRate, cmdRead->dummyCycles);
                    }
            }

            if (CY_SMIF_SUCCESS == status)
            {
                status = Cy_SMIF_ReceiveDataBlocking_Ext(base,
                         rxBuffer,
                         chunk,
                         cmdRead->dataWidth,
                         cmdRead->dataRate,
                         context);
            }
#else
            status = Cy_SMIF_TransmitCommand(base,
                                             (uint8_t)cmdRead->command,
                                             cmdRead->cmdWidth,
                                             (const uint8_t *)addrArray,
                                             memConfig->deviceCfg->numOfAddrBytes,
                                             cmdRead->addrWidth,
                                             memConfig->slaveSelect,
                                             CY_SMIF_TX_NOT_LAST_BYTE,
                                             context);

            if ((CY_SMIF_SUCCESS == status) && (CY_SMIF_NO_COMMAND_OR_MODE != cmdRead->mode))
            {
                status = Cy_SMIF_TransmitCommand(base,
                                                 (uint8_t)cmdRead->mode,
                                                 cmdRead->modeWidth,
                                                 NULL,
                                                 CY_SMIF_CMD_WITHOUT_PARAM,
                                                 CY_SMIF_WIDTH_NA,
                                                 memConfig->slaveSelect,
                                                 CY_SMIF_TX_NOT_LAST_BYTE,
                                                 context);
            }

            if ((CY_SMIF_SUCCESS == status) && (0U < cmdRead->dummyCycles))
            {
                status = Cy_SMIF_SendDummyCycles(base, cmdRead->dummyCycles);
            }

            if (CY_SMIF_SUCCESS == status)
            {
                status = Cy_SMIF_ReceiveDataBlocking(base,
                                                     rxBuffer,
                                                     chunk,
                                                     cmdRead->dataWidth,
                                                     context);
            }
#endif /* CY_IP_MXSMIF_VERSION */

            if (CY_SMIF_SUCCESS != status)
            {
                break;
            }

            /* Recalculate the next rxBuffer offset */
            length -= chunk;
            address += chunk;
            rxBuffer = (uint8_t *)rxBuffer + chunk;
        }
        /* Restore interrupts */
        if (_FLD2VAL(SMIF_CTL_XIP_MODE, SMIF_CTL(base)) != 0U)
        {
            Cy_SysLib_ExitCriticalSection(interruptState);
        }
    }

