PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif_memslot.c
    return status;
}


/*******************************************************************************
* Function Name: Cy_SMIF_MemWrite
****************************************************************************//**
*
* This function writes data to the external memory.
* This is a blocking function, it will block the execution flow until
* the command transmission is completed.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* The memory device configuration.
*
* \param address
* The address to write data at. In case of Octal DDR, address must be an even address.
*
* \param txBuffer
* The buffer holding the data to write in the external memory.
*
* \param length
* The size of data to write.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return The status of the operation. See \ref cy_en_smif_status_t.
*
* \funcusage
* \snippet smif/snippet/main.c snippet_Cy_SMIF_MemWrite
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemWrite(SMIF_Type *base, cy_stc_smif_mem_config_t const *memConfig,
                                     uint32_t address, uint8_t const txBuffer[],
                                     uint32_t length, cy_stc_smif_context_t const *context)
{
    cy_en_smif_status_t status = CY_SMIF_BAD_PARAM;
    uint32_t offset = 0UL;
    uint32_t chunk = 0UL;
    uint32_t pageSize;
    uint8_t addrArray[CY_SMIF_FOUR_BYTES_ADDR] = {0U};
    cy_stc_smif_mem_cmd_t *cmdProgram;

    CY_ASSERT_L1(NULL != memConfig);
    CY_ASSERT_L1(NULL != txBuffer);

    pageSize = memConfig->deviceCfg->programSize; /* Get the page size */
    cmdProgram = memConfig->deviceCfg->programCmd; /* Get the program command */

    if ((address + length) <= memConfig->deviceCfg->memSize) /* Check if the address exceeds the memory size */
    {
        uint32_t interruptState = 0;

        /* If XIP is enabled, disable interrupts to avoid task switching to XIP location */
        if (_FLD2VAL(SMIF_CTL_XIP_MODE, SMIF_CTL(base)) != 0U)
        {
            interruptState = Cy_SysLib_EnterCriticalSection();
        }
        /* SMIF can read only up to 65536 bytes in one go. Split the larger read into multiple chunks */
        while (length > 0UL)
        {
            /* Get the number of bytes which can be written during one operation */
            offset = address % pageSize;
            chunk = ((offset + length) < pageSize) ? length : (pageSize - offset);

            /* The Write Enable bit may be cleared by the memory after every successful
             * operation of write or erase operations. Therefore, must be set for
             * every loop.
             */
            status = Cy_SMIF_MemCmdWriteEnable(base, memConfig, context);

            if (CY_SMIF_SUCCESS == status)
            {
                ValueToByteArray(address, &addrArray[0], 0UL,
                                 memConfig->deviceCfg->numOfAddrBytes);
#if (CY_IP_MXSMIF_VERSION>=2)
                status = Cy_SMIF_TransmitCommand_Ext(base,
                                                     (uint16_t)(cmdProgram->command | cmdProgram->commandH << 8),
                                                     (bool)cmdProgram->commandH,
                                                     cmdProgram->cmdWidth, cmdProgram->cmdRate,
                                                     (const uint8_t *)addrArray, memConfig->deviceCfg->numOfAddrBytes,
                                                     cmdProgram->addrWidth, cmdProgram->addrRate,
                                                     memConfig->slaveSelect, CY_SMIF_TX_NOT_LAST_BYTE, context);

                if ((CY_SMIF_SUCCESS == status) && (CY_SMIF_NO_COMMAND_OR_MODE != cmdProgram->mode))
                {
                    status = Cy_SMIF_TransmitCommand_Ext(base,
                                                         (uint16_t)cmdProgram->mode, false,
                                                         cmdProgram->modeWidth, cmdProgram->modeRate,
                                                         NULL, CY_SMIF_CMD_WITHOUT_PARAM, CY_SMIF_WIDTH_NA,
                                                         cmdProgram->modeRate, memConfig->slaveSelect,
                                                         CY_SMIF_TX_NOT_LAST_BYTE, context);
                }

                if ((CY_SMIF_SUCCESS == status) && (cmdProgram->dummyCycles > 0U))
                {
#if ((CY_IP_MXSMIF_VERSION==2) || (CY_IP_MXSMIF_VERSION==3))
                    uint32_t ifRxSel = _FLD2VAL(SMIF_CTL_CLOCK_IF_RX_SEL, SMIF_CTL(base));

                    if (ifRxSel == (uint32_t)CY_SMIF_SEL_SPHB_RWDS_CLK || ifRxSel == (uint32_t)CY_SMIF_SEL_INVERTED_SPHB_RWDS_CLK)
                    {
                        status = Cy_SMIF_SendDummyCycles_With_RWDS(base, false, (cmdProgram->dummyCyclesPresence == CY_SMIF_PRESENT_2BYTE), cmdProgram->dummyCycles);
                    }
                    else
#endif
#if (CY_IP_MXSMIF_VERSION >= 4)
                        if (_FLD2VAL(SMIF_CORE_CTL2_RX_CAPTURE_MODE, (SMIF_CTL2(base))) == (uint32_t)CY_SMIF_SEL_XSPI_HYPERBUS_WITH_DQS)
                        {
                            status = Cy_SMIF_SendDummyCycles_With_RWDS(base, false, (cmdProgram->dummyCyclesPresence == CY_SMIF_PRESENT_2BYTE), cmdProgram->dummyCycles);
                        }
                        else
#endif
                        {
                            status = Cy_SMIF_SendDummyCycles_Ext(base, cmdProgram->dataWidth, cmdProgram->dataRate, cmdProgram->dummyCycles);
                        }
                }

                if (CY_SMIF_SUCCESS == status)
                {
                    status = Cy_SMIF_TransmitDataBlocking_Ext(base,
                             (uint8_t *)txBuffer, chunk,
                             cmdProgram->dataWidth, cmdProgram->dataRate, context);
                }
#else
                status = Cy_SMIF_TransmitCommand(base,
                                                 (uint8_t)cmdProgram->command,
                                                 cmdProgram->cmdWidth,
                                                 (const uint8_t *)addrArray,
                                                 memConfig->deviceCfg->numOfAddrBytes,
                                                 cmdProgram->addrWidth,
                                                 memConfig->slaveSelect,
                                                 CY_SMIF_TX_NOT_LAST_BYTE,
                                                 context);

                if ((CY_SMIF_SUCCESS == status) && (CY_SMIF_NO_COMMAND_OR_MODE != cmdProgram->mode))
                {
                    status = Cy_SMIF_TransmitCommand(base,
                                                     (uint8_t)cmdProgram->mode,
                                                     cmdProgram->modeWidth,
                                                     NULL,
                                                     CY_SMIF_CMD_WITHOUT_PARAM,
                                                     CY_SMIF_WIDTH_NA,
                                                     memConfig->slaveSelect,
                                                     CY_SMIF_TX_NOT_LAST_BYTE,
                                                     context);
                }

                if ((CY_SMIF_SUCCESS == status) && (cmdProgram->dummyCycles > 0U))
                {
                    status = Cy_SMIF_SendDummyCycles(base, cmdProgram->dummyCycles);
                }

                if (CY_SMIF_SUCCESS == status)
                {
                    status = Cy_SMIF_TransmitDataBlocking(base,
                                                          (uint8_t *)txBuffer,
                                                          chunk,
                                                          cmdProgram->dataWidth,
                                                          context);
                }
#endif /* CY_IP_MXSMIF_VERSION */
                if ((CY_SMIF_SUCCESS == status) && (NULL != memConfig->deviceCfg->readStsRegWipCmd))
                {
                    /* Check if the memory has completed the write operation. ProgramTime is in microseconds */
                    status = Cy_SMIF_MemIsReady(base, memConfig, memConfig->deviceCfg->programTime, context);
                }
            }

            if (CY_SMIF_SUCCESS != status)
            {
                break;
            }

            /* Recalculate the next rxBuffer offset */
            txBuffer = (uint8_t *)txBuffer + chunk;
            address += chunk;
            length -= chunk;
        }
        /* Restore interrupts */
        if (_FLD2VAL(SMIF_CTL_XIP_MODE, SMIF_CTL(base)) != 0U)
        {
            Cy_SysLib_ExitCriticalSection(interruptState);
        }
    }

