PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif_memslot.c
    return status;
}


/*******************************************************************************
* Function Name: Cy_SMIF_MemEraseSector
****************************************************************************//**
*
* Erases a block/sector of the external memory.
* This is a blocking function, it will block the execution flow until
* the command transmission is completed.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* The memory device configuration.
*
* \param address
* The address of the block to be erased. The address will be aligned to
* the start address of the sector in which address is located.
*
* \param length
* The length of data to erase. The length will be aligned to the sector
* boundary where end address is located. If length exceeds memory size
* API returns \ref CY_SMIF_BAD_PARAM without performing erase operation.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return The status of the operation. See \ref cy_en_smif_status_t.
*
* \note Memories like hybrid have sectors of different sizes. \n
* Check the address and length parameters before calling this function.
*
* \funcusage
* \snippet smif/snippet/main.c snippet_Cy_SMIF_MemEraseSector
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemEraseSector(SMIF_Type *base, cy_stc_smif_mem_config_t const *memConfig,
        uint32_t address, uint32_t length,
        cy_stc_smif_context_t const *context)
{
    cy_en_smif_status_t status = CY_SMIF_SUCCESS;
    uint32_t endAddress = address + length - 1UL;
    uint32_t hybridRegionEnd = 0UL;
    uint32_t hybridRegionStart = 0UL;
    uint8_t addrArray[CY_SMIF_FOUR_BYTES_ADDR] = {0U};
    cy_stc_smif_hybrid_region_info_t *hybrInfo = NULL;
    CY_ASSERT_L1(NULL != memConfig);
    cy_stc_smif_mem_device_cfg_t *device = memConfig->deviceCfg;
    uint32_t eraseSectorSize = device->eraseSize;
    uint32_t maxEraseTime = device->eraseTime;

    /* Check if the address exceeds the memory size */
    if (endAddress < device->memSize)
    {
        /* Align start address and end address to corresponding sector boundary */
        cy_stc_smif_hybrid_region_info_t *regionInfo = NULL;

        /* Check if it is a hybrid memory */
        status = Cy_SMIF_MemLocateHybridRegion(memConfig, &regionInfo, address);

        if ((CY_SMIF_SUCCESS == status) && (regionInfo != NULL)) /* Hybrid */
        {
            uint32_t offsetInRegion = address - regionInfo->regionAddress;
            uint32_t sectorOffsetInRegion = offsetInRegion / regionInfo->eraseSize;

            /* Align start address */
            address = regionInfo->regionAddress + (sectorOffsetInRegion * regionInfo->eraseSize);

            /* Last hybrid region in desired block */
            status = Cy_SMIF_MemLocateHybridRegion(memConfig, &regionInfo, endAddress);
            if (CY_SMIF_SUCCESS == status)
            {
                offsetInRegion = endAddress - regionInfo->regionAddress + 1UL;
                sectorOffsetInRegion  = offsetInRegion / regionInfo->eraseSize;
                if (0UL != offsetInRegion % regionInfo->eraseSize)
                {
                    sectorOffsetInRegion++;
                }
                /* Align end address */
                endAddress = regionInfo->regionAddress + (sectorOffsetInRegion * regionInfo->eraseSize) - 1UL;

                /* Update length according the aligned start address and end address */
                length = endAddress - address + 1UL;
            }
        }
        else /* Not hybrid (unified) sectors layout */
        {
            /* If start address is somewhere at the middle of erase page, align it to the page start */
            if (0UL != (address % eraseSectorSize))
            {
                address = eraseSectorSize * (address / eraseSectorSize);
            }

            /* If end address is somewhere at the middle of erase page, align it to the page end */
            if (0UL != ((endAddress + 1UL) % eraseSectorSize))
            {
                endAddress = (((endAddress + eraseSectorSize - 1UL) / eraseSectorSize) * eraseSectorSize) - 1UL;
            }
            /* Update length according the aligned start address and end address */
            length = endAddress - address + 1UL;

            status = CY_SMIF_SUCCESS;
        }

        /* Check if the address exceeds the memory size */
        if (endAddress < device->memSize)
        {
            uint32_t interruptState = 0UL;

            /* If XIP is enabled, disable interrupts to avoid task switching to a code running in
             * XIP when erase operation is ongoing */
            if (_FLD2VAL(SMIF_CTL_XIP_MODE, SMIF_CTL(base)) != 0U)
            {
                interruptState = Cy_SysLib_EnterCriticalSection();
            }

            while (length > 0UL)
            {
                /* In case of hybrid memory - update erase size and time for current region */
                status = Cy_SMIF_MemLocateHybridRegion(memConfig, &hybrInfo, address);
                if (CY_SMIF_SUCCESS == status)
                {
                    maxEraseTime =  hybrInfo->eraseTime;
                    eraseSectorSize = hybrInfo->eraseSize;
                    hybridRegionStart = hybrInfo->regionAddress;
                    hybridRegionEnd = (hybrInfo->sectorsCount * eraseSectorSize) + hybridRegionStart - 1UL;
                    if (endAddress < hybridRegionEnd)
                    {
                        hybridRegionEnd = endAddress;
                    }
                }
                else
                {
                    hybridRegionEnd = endAddress;
                }

                while (address < hybridRegionEnd)
                {
                    /* The Write Enable bit may be cleared by the memory after every successful
                    * operation of write/erase operations. Therefore, it must be set for
                    * every loop.
                    */
                    status = Cy_SMIF_MemCmdWriteEnable(base, memConfig, context);
                    if (CY_SMIF_SUCCESS == status)
                    {
                        ValueToByteArray(address, &addrArray[0], 0UL, device->numOfAddrBytes);

                        /* Send the command to erase one sector */
                        status = Cy_SMIF_MemCmdSectorErase(base, (cy_stc_smif_mem_config_t*)memConfig,
                                                           (const uint8_t *)addrArray, context);
                        if (CY_SMIF_SUCCESS == status)
                        {
                            /* Wait until the erase operation is completed or a timeout occurs.
                             * Note: eraseTime is in milliseconds */
                            status = Cy_SMIF_MemIsReady(base, memConfig, (maxEraseTime * ONE_MILLI_IN_MICRO), context);

                            /* Recalculate the next sector address offset */
                            if (length > eraseSectorSize)
                            {
                                address += eraseSectorSize;
                                length -= eraseSectorSize;
                            }
                            else
                            {
                                length = 0;
                                break;
                            }
                        }
                    }

                    if (CY_SMIF_SUCCESS != status)
                    {
                        break;
                    }
                }
            }

            /* Restore interrupts */
            if (_FLD2VAL(SMIF_CTL_XIP_MODE, SMIF_CTL(base)) != 0U)
            {
                Cy_SysLib_ExitCriticalSection(interruptState);
            }
        }
        else
        {
            /* Aligned end address exceeds memory size */
            status = CY_SMIF_BAD_PARAM;
        }
    }
    else
    {
        /* end address exceeds memory size */
        status = CY_SMIF_BAD_PARAM;
    }

