PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif_memslot.c
    return status;
}


/*******************************************************************************
* Function Name: Cy_SMIF_MemEraseChip
****************************************************************************//**
*
* Erases the entire chip of the external memory.
* This is a blocking function, it will block the execution flow until
* the command transmission is completed.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* The memory device configuration.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return The status of the operation. See \ref cy_en_smif_status_t.
*
* \funcusage
* \snippet smif/snippet/main.c snippet_Cy_SMIF_MemEraseChip
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemEraseChip(SMIF_Type *base, cy_stc_smif_mem_config_t const *memConfig,
        cy_stc_smif_context_t const *context)
{
    cy_en_smif_status_t status;

    CY_ASSERT_L1(NULL != memConfig);

    /* The Write Enable bit may be cleared by the memory after every successful
    * operation of write/erase operations. Therefore, it must be set for
    * every loop
    */
    status = Cy_SMIF_MemCmdWriteEnable(base, memConfig, context);

    if (CY_SMIF_SUCCESS == status)
    {
        /* Send the command to erase the entire chip */
        status = Cy_SMIF_MemCmdChipErase(base, memConfig, context);

        if (CY_SMIF_SUCCESS == status)
        {
            /* Wait until the erase operation is completed or a timeout occurs. chipEraseTime is in milliseconds */
            status = Cy_SMIF_MemIsReady(base, memConfig,
                                        (memConfig->deviceCfg->chipEraseTime * ONE_MILLI_IN_MICRO), context);
        }
    }

    return status;
}

/*******************************************************************************
* Function Name: Cy_SMIF_MemCmdPowerDown
****************************************************************************//**
*
* This function sends a Power-down command to the selected memory device in
* Single SPI mode. Please note that, once \ref Cy_SMIF_MemCmdPowerDown is issued, external
* memory will not respond to any other command except \ref Cy_SMIF_MemCmdReleasePowerDown.
*
* \note This function uses the low-level Cy_SMIF_TransmitCommand() API.
* Cy_SMIF_TransmitCommand() API works in a blocking mode. In the dual quad mode
* this API should be called for each memory.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memDevice
* The device to which the command is sent.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of the command transmission.
*        - \ref CY_SMIF_SUCCESS
*        - \ref CY_SMIF_EXCEED_TIMEOUT
*
* \snippet smif/snippet/main.c SMIF_API: PowerDown
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemCmdPowerDown(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        cy_stc_smif_context_t const *context)
{

    cy_en_smif_status_t result;

    /* The memory Power-down command */
    result = Cy_SMIF_TransmitCommand(base, CY_SMIF_POWER_DOWN_CMD,
                                     CY_SMIF_WIDTH_SINGLE,
                                     NULL,
                                     CY_SMIF_CMD_WITHOUT_PARAM,
                                     CY_SMIF_WIDTH_NA,
                                     memDevice->slaveSelect,
                                     CY_SMIF_TX_LAST_BYTE,
                                     context);

    return result;
}
/*******************************************************************************
* Function Name: Cy_SMIF_MemCmdReleasePowerDown
****************************************************************************//**
*
* This function sends a Release Power-down command to the selected memory device
* in Single SPI mode.
*
* \note This function uses the low-level Cy_SMIF_TransmitCommand() API.
* Cy_SMIF_TransmitCommand() API works in a blocking mode. In the dual quad mode
* this API should be called for each memory.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memDevice
* The device to which the command is sent.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of the command transmission.
*        - \ref CY_SMIF_SUCCESS
*        - \ref CY_SMIF_EXCEED_TIMEOUT
*
* \snippet smif/snippet/main.c SMIF_API: PowerDown
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemCmdReleasePowerDown(SMIF_Type *base,
        cy_stc_smif_mem_config_t const *memDevice,
        cy_stc_smif_context_t const *context)
{

    cy_en_smif_status_t result;

    /* The memory Release Power-down command */
    result = Cy_SMIF_TransmitCommand(base, CY_SMIF_RELEASE_POWER_DOWN_CMD,
                                     CY_SMIF_WIDTH_SINGLE,
                                     NULL,
                                     CY_SMIF_CMD_WITHOUT_PARAM,
                                     CY_SMIF_WIDTH_NA,
                                     memDevice->slaveSelect,
                                     CY_SMIF_TX_LAST_BYTE,
                                     context);

    return result;
}

#if (CY_IP_MXSMIF_VERSION >= 5) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SMIF_MemEnableFWCalibration
****************************************************************************//**
*
* This function enables Firmware Calibration mode for the device. Once firmware calibration
* mode is enabled, user can add delay taps for selected data line using \ref Cy_SMIF_GetSelectedDelayTapSel
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param slave
* Holds the slave select line for which delay tap setting should be applied for.
*
*******************************************************************************/

