PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_smif_memslot.c
void Cy_SMIF_MemEnableFWCalibration(SMIF_Type *base, cy_en_smif_slave_select_t slave)
{
    SMIF_DEVICE_Type volatile * device = Cy_SMIF_GetDeviceBySlot(base, slave);
    SMIF_DEVICE_RX_CAPTURE_CONFIG(device) |= SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_FW_CALIBRATION_MODE_Msk;
}

/*******************************************************************************
* Function Name: Cy_SMIF_MemDisableFWCalibration
****************************************************************************//**
*
* This function disables Firmware Calibration mode for the device.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param slave
* Holds the slave select line for which delay tap setting should be applied for.
*
*******************************************************************************/
void Cy_SMIF_MemDisableFWCalibration(SMIF_Type *base, cy_en_smif_slave_select_t slave)
{
    SMIF_DEVICE_Type volatile * device = Cy_SMIF_GetDeviceBySlot(base, slave);
    SMIF_DEVICE_RX_CAPTURE_CONFIG(device) &= ~SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_FW_CALIBRATION_MODE_Msk;
}

/*******************************************************************************
* Function Name: Cy_SMIF_MemSetDataLineDelayTap
****************************************************************************//**
*
* This function sets delay tap for a particular data line. \ref Cy_SMIF_MemEnableFWCalibration
* should be called to get this setting into effect.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param slave
* Holds the slave select line for which delay tap setting should be applied for.
*
* \param data_line
* Holds the data line for which delay tap setting should be applied for.
*
* \param tapSel
* tap selection value (0-15) where lower nibble indicates the delay tap setting for positive clock phase
* and higher nibble indicates the setting for negative clock phase delay tap selection.
*
* \return \ref cy_en_smif_status_t
*         CY_SMIF_SUCCESS - If delay tap is set.
*         CY_SMIF_BAD_PARAM - If user tries to set delay tap without enabling FW Calibration mode.
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_SetSelectedDelayTapSel(SMIF_Type *base,
        cy_en_smif_slave_select_t slave,
        cy_en_smif_mem_data_line_t data_line,
        uint8_t tapSel)
{
    cy_en_smif_status_t result = CY_SMIF_GENERAL_ERROR;

    SMIF_DEVICE_Type volatile * device = Cy_SMIF_GetDeviceBySlot(base, slave);

    /* Check if DEVICE is in FW CALIBRATION MODE */
    if ((SMIF_DEVICE_RX_CAPTURE_CONFIG(device) & SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_FW_CALIBRATION_MODE_Msk) != 0UL)
    {
        result = CY_SMIF_SUCCESS;

        switch (data_line)
        {
        case CY_SMIF_DATA_BIT0_TAP_SEL:
        {
            SMIF_DEVICE_HB_FW_DEL_TAP_SEL_0(device) = _VAL2FLD(SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT0_TAP_SEL_POS, tapSel);
            break;
        }
        case CY_SMIF_DATA_BIT1_TAP_SEL:
        {
            SMIF_DEVICE_HB_FW_DEL_TAP_SEL_0(device) = _VAL2FLD(SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT1_TAP_SEL_POS, tapSel);
            break;
        }
        case CY_SMIF_DATA_BIT2_TAP_SEL:
        {
            SMIF_DEVICE_HB_FW_DEL_TAP_SEL_0(device) = _VAL2FLD(SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT2_TAP_SEL_POS, tapSel);
            break;
        }
        case CY_SMIF_DATA_BIT3_TAP_SEL:
        {
            SMIF_DEVICE_HB_FW_DEL_TAP_SEL_0(device) = _VAL2FLD(SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT3_TAP_SEL_POS, tapSel);
            break;
        }
        case CY_SMIF_DATA_BIT4_TAP_SEL:
        {
            SMIF_DEVICE_HB_FW_DEL_TAP_SEL_1(device) = _VAL2FLD(SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT4_TAP_SEL_POS, tapSel);
            break;
        }
        case CY_SMIF_DATA_BIT5_TAP_SEL:
        {
            SMIF_DEVICE_HB_FW_DEL_TAP_SEL_1(device) = _VAL2FLD(SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT5_TAP_SEL_POS, tapSel);
            break;
        }
        case CY_SMIF_DATA_BIT6_TAP_SEL:
        {
            SMIF_DEVICE_HB_FW_DEL_TAP_SEL_1(device) = _VAL2FLD(SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT6_TAP_SEL_POS, tapSel);
            break;
        }
        case CY_SMIF_DATA_BIT7_TAP_SEL:
        {
            SMIF_DEVICE_HB_FW_DEL_TAP_SEL_1(device) = _VAL2FLD(SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT7_TAP_SEL_POS, tapSel);
            break;
        }
        default:
        {
            /* Unsupported data line index */
            break;
        }
        }
    }
    else
    {
        result = CY_SMIF_BAD_PARAM;
    }

    return result;
}
/*******************************************************************************
* Function Name: Cy_SMIF_GetSelectedDelayTapSel
****************************************************************************//**
*
* This function gets delay tap set for a particular data line.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param slave
* Holds the slave select line for which delay tap setting should be retrieved.
*
* \param data_line
* Holds the data line for which delay tap setting should be retrieved.
*
* \return uint8_t
* tap selection value where lower nibble indicates the delay tap setting for positive clock phase
* and higher nibble indicates the setting for negative clock phase delay tap selection.
*
*******************************************************************************/
uint8_t Cy_SMIF_GetSelectedDelayTapSel(SMIF_Type *base, cy_en_smif_slave_select_t slave, cy_en_smif_mem_data_line_t data_line)
{
    SMIF_DEVICE_Type volatile * device = Cy_SMIF_GetDeviceBySlot(base, slave);
    uint8_t delay_tap = 0;

    switch (data_line)
    {
    case CY_SMIF_DATA_BIT0_TAP_SEL:
    {
        delay_tap = (uint8_t)(_FLD2VAL(SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT0_TAP_SEL_POS, SMIF_DEVICE_HB_FW_DEL_TAP_SEL_0(device)));
        break;
    }
    case CY_SMIF_DATA_BIT1_TAP_SEL:
    {
        delay_tap = (uint8_t)(_FLD2VAL(SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT1_TAP_SEL_POS, SMIF_DEVICE_HB_FW_DEL_TAP_SEL_0(device)));
        break;
    }
    case CY_SMIF_DATA_BIT2_TAP_SEL:
    {
        delay_tap = (uint8_t)(_FLD2VAL(SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT2_TAP_SEL_POS, SMIF_DEVICE_HB_FW_DEL_TAP_SEL_0(device)));
        break;
    }
    case CY_SMIF_DATA_BIT3_TAP_SEL:
    {
        delay_tap = (uint8_t)(_FLD2VAL(SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_0_DATA_BIT3_TAP_SEL_POS, SMIF_DEVICE_HB_FW_DEL_TAP_SEL_0(device)));
        break;
    }
    case CY_SMIF_DATA_BIT4_TAP_SEL:
    {
        delay_tap = (uint8_t)(_FLD2VAL(SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT4_TAP_SEL_POS, SMIF_DEVICE_HB_FW_DEL_TAP_SEL_1(device)));
        break;
    }
    case CY_SMIF_DATA_BIT5_TAP_SEL:
    {
        delay_tap = (uint8_t)(_FLD2VAL(SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT5_TAP_SEL_POS, SMIF_DEVICE_HB_FW_DEL_TAP_SEL_1(device)));
        break;
    }
    case CY_SMIF_DATA_BIT6_TAP_SEL:
    {
        delay_tap = (uint8_t)(_FLD2VAL(SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT6_TAP_SEL_POS, SMIF_DEVICE_HB_FW_DEL_TAP_SEL_1(device)));
        break;
    }
    case CY_SMIF_DATA_BIT7_TAP_SEL:
    {
        delay_tap = (uint8_t)(_FLD2VAL(SMIF_CORE_DEVICE_HB_FW_DEL_TAP_SEL_1_DATA_BIT7_TAP_SEL_POS, SMIF_DEVICE_HB_FW_DEL_TAP_SEL_1(device)));
        break;
    }
    default:
    {
        /* Unsupported data line index */
        break;
    }
    }
    return delay_tap;
}

